app/Controllers/Arbusto.php

SELECT *
FROM `planta_arbusto`
---
    public function mostrar()
    {
        $arbustoModel = model('ArbustoModel');
        $data['planta_arbustos'] = $arbustoModel->findAll();